; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p9---int100n150-m25---int100c110---s116---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level7 level7)
(sum level0 level9 level9)
(sum level0 level11 level11)
(sum level0 level12 level12)
(sum level0 level24 level24)
(sum level1 level3 level4)
(sum level1 level7 level8)
(sum level1 level9 level10)
(sum level1 level11 level12)
(sum level1 level12 level13)
(sum level1 level24 level25)
(sum level2 level3 level5)
(sum level2 level7 level9)
(sum level2 level9 level11)
(sum level2 level11 level13)
(sum level2 level12 level14)
(sum level2 level24 level26)
(sum level3 level3 level6)
(sum level3 level7 level10)
(sum level3 level9 level12)
(sum level3 level11 level14)
(sum level3 level12 level15)
(sum level3 level24 level27)
(sum level4 level3 level7)
(sum level4 level7 level11)
(sum level4 level9 level13)
(sum level4 level11 level15)
(sum level4 level12 level16)
(sum level4 level24 level28)
(sum level5 level3 level8)
(sum level5 level7 level12)
(sum level5 level9 level14)
(sum level5 level11 level16)
(sum level5 level12 level17)
(sum level5 level24 level29)
(sum level6 level3 level9)
(sum level6 level7 level13)
(sum level6 level9 level15)
(sum level6 level11 level17)
(sum level6 level12 level18)
(sum level6 level24 level30)
(sum level7 level3 level10)
(sum level7 level7 level14)
(sum level7 level9 level16)
(sum level7 level11 level18)
(sum level7 level12 level19)
(sum level7 level24 level31)
(sum level8 level3 level11)
(sum level8 level7 level15)
(sum level8 level9 level17)
(sum level8 level11 level19)
(sum level8 level12 level20)
(sum level8 level24 level32)
(sum level9 level3 level12)
(sum level9 level7 level16)
(sum level9 level9 level18)
(sum level9 level11 level20)
(sum level9 level12 level21)
(sum level9 level24 level33)
(sum level10 level3 level13)
(sum level10 level7 level17)
(sum level10 level9 level19)
(sum level10 level11 level21)
(sum level10 level12 level22)
(sum level10 level24 level34)
(sum level11 level3 level14)
(sum level11 level7 level18)
(sum level11 level9 level20)
(sum level11 level11 level22)
(sum level11 level12 level23)
(sum level11 level24 level35)
(sum level12 level3 level15)
(sum level12 level7 level19)
(sum level12 level9 level21)
(sum level12 level11 level23)
(sum level12 level12 level24)
(sum level12 level24 level36)
(sum level13 level3 level16)
(sum level13 level7 level20)
(sum level13 level9 level22)
(sum level13 level11 level24)
(sum level13 level12 level25)
(sum level14 level3 level17)
(sum level14 level7 level21)
(sum level14 level9 level23)
(sum level14 level11 level25)
(sum level14 level12 level26)
(sum level15 level3 level18)
(sum level15 level7 level22)
(sum level15 level9 level24)
(sum level15 level11 level26)
(sum level15 level12 level27)
(sum level16 level3 level19)
(sum level16 level7 level23)
(sum level16 level9 level25)
(sum level16 level11 level27)
(sum level16 level12 level28)
(sum level17 level3 level20)
(sum level17 level7 level24)
(sum level17 level9 level26)
(sum level17 level11 level28)
(sum level17 level12 level29)
(sum level18 level3 level21)
(sum level18 level7 level25)
(sum level18 level9 level27)
(sum level18 level11 level29)
(sum level18 level12 level30)
(sum level19 level3 level22)
(sum level19 level7 level26)
(sum level19 level9 level28)
(sum level19 level11 level30)
(sum level19 level12 level31)
(sum level20 level3 level23)
(sum level20 level7 level27)
(sum level20 level9 level29)
(sum level20 level11 level31)
(sum level20 level12 level32)
(sum level21 level3 level24)
(sum level21 level7 level28)
(sum level21 level9 level30)
(sum level21 level11 level32)
(sum level21 level12 level33)
(sum level22 level3 level25)
(sum level22 level7 level29)
(sum level22 level9 level31)
(sum level22 level11 level33)
(sum level22 level12 level34)
(sum level23 level3 level26)
(sum level23 level7 level30)
(sum level23 level9 level32)
(sum level23 level11 level34)
(sum level23 level12 level35)
(sum level24 level3 level27)
(sum level24 level7 level31)
(sum level24 level9 level33)
(sum level24 level11 level35)
(sum level24 level12 level36)
(sum level25 level3 level28)
(sum level25 level7 level32)
(sum level25 level9 level34)
(sum level25 level11 level36)
(sum level26 level3 level29)
(sum level26 level7 level33)
(sum level26 level9 level35)
(sum level27 level3 level30)
(sum level27 level7 level34)
(sum level27 level9 level36)
(sum level28 level3 level31)
(sum level28 level7 level35)
(sum level29 level3 level32)
(sum level29 level7 level36)
(sum level30 level3 level33)
(sum level31 level3 level34)
(sum level32 level3 level35)
(sum level33 level3 level36)

(connected l0 l1)
(fuelcost level7 l0 l1)
(connected l0 l2)
(fuelcost level24 l0 l2)
(connected l0 l3)
(fuelcost level11 l0 l3)
(connected l1 l0)
(fuelcost level7 l1 l0)
(connected l1 l2)
(fuelcost level3 l1 l2)
(connected l1 l3)
(fuelcost level12 l1 l3)
(connected l2 l0)
(fuelcost level24 l2 l0)
(connected l2 l1)
(fuelcost level3 l2 l1)
(connected l2 l3)
(fuelcost level9 l2 l3)
(connected l3 l0)
(fuelcost level11 l3 l0)
(connected l3 l1)
(fuelcost level12 l3 l1)
(connected l3 l2)
(fuelcost level9 l3 l2)

(at t0 l2)
(fuel t0 level36)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l0)
(at p3 l3)
(at p4 l0)
(at p5 l3)
(at p6 l2)
(at p7 l1)
(at p8 l2)
)

(:goal
(and
(at p0 l2)
(at p1 l1)
(at p2 l2)
(at p3 l1)
(at p4 l2)
(at p5 l1)
(at p6 l0)
(at p7 l0)
(at p8 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 0 of 9
2. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 9
3. (drive t0 l2 l1 level33 level3 level36)
   deleted: (at t0 l2) (fuel t0 level36)
   added: (at t0 l1) (fuel t0 level33)
   goals met: 0 of 9
4. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 9
5. (drive t0 l1 l0 level26 level7 level33)
   deleted: (at t0 l1) (fuel t0 level33)
   added: (at t0 l0) (fuel t0 level26)
   goals met: 0 of 9
6. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 9
7. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 9
8. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 9
9. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 0 of 9
10. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 1 of 9
11. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 2 of 9
12. (drive t0 l0 l3 level15 level11 level26)
   deleted: (at t0 l0) (fuel t0 level26)
   added: (at t0 l3) (fuel t0 level15)
   goals met: 2 of 9
13. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 2 of 9
14. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 2 of 9
15. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 3 of 9
16. (drive t0 l3 l1 level3 level12 level15)
   deleted: (at t0 l3) (fuel t0 level15)
   added: (at t0 l1) (fuel t0 level3)
   goals met: 3 of 9
17. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 4 of 9
18. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 5 of 9
19. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 6 of 9
20. (drive t0 l1 l2 level0 level3 level3)
   deleted: (at t0 l1) (fuel t0 level3)
   added: (at t0 l2) (fuel t0 level0)
   goals met: 6 of 9
21. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 7 of 9
22. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 8 of 9
23. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 9 of 9
